Practicas/PracticasGretl/pub/Lecc06.tex
% Created 2023-11-02 jue 20:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 6}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\section{Varianza de los estimadores}
\label{sec:org5c86503}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/EjPvivienda3.inp}{EjPvivienda3.inp}\\[0pt]
\end{tabular}
\end{center}


Observe la matriz \InvXTX, del ejemplo del ``precio de las viviendas''.
\begin{displaymath}
   \InvXTX=
   \begin{bmatrix}
     9.1293e-01 & -4.4036e-04\\
     -4.4036e-04 & 2.3044e-07
   \end{bmatrix};
\end{displaymath}    
¿Qué estimación cree que es más fiable, la de la pendiente o la de la
constante?

\begin{itemize}
\item Calcule dicha matriz \(\InvXTX\) con Gretl.
\end{itemize}

\begin{verbatim}
open data3-1
matrix X      = {const, sqft}
matrix invXTX = invpd(X'X)
print invXTX 
\end{verbatim}

\begin{itemize}
\item Realice la regresión de los precios sobre la superficie y añada el
ajuste a la tabla de modelos (la opción \texttt{-{}-vcv} muestra la matriz de
varianzas y covarianzas de los estimadores (\(\cvarM{}\InvXTX\)) que
Gretl estima con la muestra empleada en el ajuste \texttt{ols}). Compruebe
que si multiplica la matriz \texttt{invXTX} por la cuasivarianza de los
errores obtiene el mismo resultado.
\end{itemize}
\begin{verbatim}
ols price const sqft --vcv
modeltab add                              # incluimos el modelo a la tabla de modelos
matrix cv2invXTX = $ess/$df * invXTX 
print cv2invXTX
\end{verbatim}

\begin{itemize}
\item Repita el punto anterior pero con las siguientes modificaciones:

\begin{enumerate}
\item con todos los datos excepto los de la última vivienda
\begin{verbatim}
smpl 1 13                                 # quitamos la primera observacion
ols price const sqft --vcv
modeltab add                              # incluimos el modelo a la tabla de modelos
smpl full                                 # recuperamos toda la muestra
\end{verbatim}

\item con todos los datos excepto los de las últimas dos viviendas
\begin{verbatim}
smpl 2 14                                 # quitamos la ultima observacion
ols price const sqft --vcv
modeltab add                              # incluimos el modelo a la tabla d
smpl full                                 # recuperamos toda la muestra
\end{verbatim}

\item con todos los datos excepto los de la primera y la última viviendas
\begin{verbatim}
smpl 2 13                                 # quitamos la primera y la ultima observaciones
ols price const sqft --vcv
modeltab add                              # incluimos el modelo a la tabla de modelos
modeltab show                             # MOSTRAMOS TODOS LOS MODELOS a la vez
\end{verbatim}
\end{enumerate}
\end{itemize}


\begin{itemize}
\item ¿Confirman los resultados de estas regresiones su respuesta a la
primera pregunta?
\end{itemize}

\clearpage
\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{EjPvivienda3.inp}}
\label{sec:org8709962}
\vspace{10pt}
\lstinputlisting{scripts/EjPvivienda3.inp}
\clearpage



\section{Un experimento de Montecarlo}
\label{sec:org4039a16}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/samplinghouses0.inp}{samplinghouses0.inp}\\[0pt]
\end{tabular}
\end{center}

Cargue los datos del ejemplo de los precios de casas unifamiliares
\texttt{data3-1.gdt}. Estime el modelo visto en clase. Guárdelo como
icono. También debe guardar como icono el diagrama de dispersión entre
\texttt{sqrt} y \texttt{price}.
\begin{verbatim}
open data3-1
Modelo0  <- ols price 0 sqft
Scatter0 <- gnuplot price sqft --output=display
\end{verbatim}

Vamos a simular este modelo generando nuevos datos por Montecarlo.

\begin{itemize}
\item Genere una serie con la parte sistemática del modelo (empleando
valores parecidos a los estimados):
\begin{verbatim}
series x  = sqft
series y1 = 52 + 0.14*x
\end{verbatim}

\item Genere una serie de perturbaciones con distribución normal, con
esperanza nula y varianza \(39\) un valor parecido al obtenido con los
datos originales
\begin{verbatim}
series u1 = randgen(N, 0, 39)
\end{verbatim}

\item Genere una nueva serie de precios sumando a la parte
sistemática las perturbaciones generadas en el paso anterior
\begin{verbatim}
# Datos de precios simulados
series y1 = ys + u1
\end{verbatim}

\item Con los nuevos datos de precios simulados ajuste el modelo de
regresión de clase. ¿Se parecen los resultados?  Grafique la nube de
puntos \texttt{x,y} ¿Observa diferencias respecto al diagrama de dispersión
original?
\begin{verbatim}
Modelo1  <- ols y1 0 x
Scatter1 <- gnuplot y1 x --output=display
\end{verbatim}

\item Repita los pasos pasos anteriores con nuevas simulaciones y observe
los cambios.
\begin{verbatim}
series u2 = randgen(N, 0, 39)
series y2 = ys + u2
Modelo2  <- ols y2 0 x
Scatter2 <- gnuplot y2 x --output=display
\end{verbatim}
\end{itemize}


\clearpage
\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{samplinghouses0.inp}}
\label{sec:orgbe7c5d2}
\vspace{10pt}
\lstinputlisting{scripts/samplinghouses0.inp}
\clearpage



\section{Repitiendo el experimento de Montecarlo muchas veces}
\label{sec:orgbfa6a45}

\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/samplinghouses1.inp}{samplinghouses1.inp}\\[0pt]
\end{tabular}
\end{center}

Vamos a simular el modelo de la práctica anterior 10000 veces para ver
hasta qué punto estamos replicando los resultados originales.

Cargue los datos del ejemplo de los precios de casas unifamiliares
\texttt{data3-1.gdt} y estime el modelo visto en clase. Guárdelo como icono
para poder consultar los resultados más tarde.

\begin{verbatim}
open data3-1.gdt
Modelo <- ols price 0 sqft
\end{verbatim}

\begin{itemize}
\item Como antes, genere una nueva serie con la parte sistemática del
modelo empleando valores de los parámetros parecidos a los
estimados.
\begin{verbatim}
series x  = sqft
series ys = 52 + 0.14*x
\end{verbatim}

\item Defina un escalar \texttt{s} con el valor aproximado de la desviación
típica de los residuos del modelo original.
\begin{verbatim}
scalar s  = 39
\end{verbatim}

\item Especifique un bucle para realizar 10000 iteraciones y que almacene
los coeficientes estimados (\texttt{-{}-progressive}) pero sin mostrar los
resultados (\texttt{-{}-quiet}) de cada iteración. \emph{Lea antes la
documentación sobre} \texttt{loops}.

Dentro del bucle indicaremos una serie de operaciones y órdenes que
se describen más abajo
\begin{verbatim}
loop 10000 --progressive --quiet
   <<Simulamos el regresando y ajustamos por MCO>>
   <<Almacenamos los parámetros estimados>>
   <<Mostramos los resultados>>
   <<Guardamos los resultados en el disco>>
endloop  
\end{verbatim}
\end{itemize}


\begin{enumerate}
\item \(\dots\) dentro del bucle introduzca las instrucciones para
simular en cada iteración un nuevo vector de precios (sumando
unas perturbaciones con media cero y desviación típica \texttt{s}. Y
realice la correspondiente regresión.
\begin{verbatim}
series y = ys + randgen(N, 0, s)
ols y const x
\end{verbatim}

\item Almacene los valores estimados de los betas correspondientes a
la constante, la pendiente y la cuasivarianza varianza de los
residuos
\begin{verbatim}
scalar b1   = $coeff(const)
scalar b2   = $coeff(x)
scalar cs2  = $ess/$df                      # cuasivarianza de los errores
\end{verbatim}

\item Indique que Gretl muestre el resumen estadístico de los
parámetros estimados en las 10000 iteraciones.
\begin{verbatim}
print b1 b2 cs2
\end{verbatim}

\item Guarde los parámetros estimados en el disco
\begin{verbatim}
store "@workdir\coef.gdt" b1 b2 cs2
\end{verbatim}
\end{enumerate}

(\emph{Puede almacenar dentro del bucle otros estadísticos (varianza
estimada, coeficiente de determinación, etc.) para observar el
comportamiento de los valores obtenidos en este experimento de
Montecarlo}.)

\begin{itemize}
\item Para analizar en detalle los valores obtenidos y almacenados en el
fichero \texttt{coef.gdt}, Gretl debe abrir y leer dicho fichero. Lo
podemos indicar en este mismo guión, pero Gretl abrirá una nueva
sesión y perderemos lo calculado con el bucle y que no haya sido
guardado en el fichero (no quiere hacerlo así, entonces tendrá que
abrir una segunda sesión de Gretl y cargar a ahí los datos del
fichero \texttt{coef.gdt}).
\begin{verbatim}
open "@workdir\coef.gdt"
\end{verbatim}

\item Observe los valores máximos y mínimos estimados, y compárelos con
los valores indicados en la simulación \texttt{b1=52}, \texttt{b2=0.14} y
\texttt{s2=39\textasciicircum{}2=1521} (verá que en algunos casos lo estimado dista mucho
del verdadero valor de los parámetros). Observe el histograma de los
valores obtenidos para los parámetros
\begin{verbatim}
summary   --simple
freq b1   --normal --silent --plot="display"
freq b2   --normal --silent --plot="display"
freq cs2  --normal --silent --plot="display"
\end{verbatim}

\item Ejecute el guión y coteje los resultados de los estadísticos
descriptivos de los betas estimados con los parámetros estimados en
el modelo original (del de los datos originales visto en clase).
\end{itemize}

\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{samplinghouses1.inp}}
\label{sec:org6635133}
\vspace{10pt}
\lstinputlisting{scripts/samplinghouses1.inp}
\clearpage

\section{Repitiendo el experimento de Montecarlo muchas veces (Matriz de covarianzas)}
\label{sec:org910a0ae}
Complete el experimento de Montecarlo de la Práctica \ref{sec:orgbfa6a45} de más arriba con el
siguiente añadido:

\begin{itemize}
\item Antes del bucle obtenga la matriz \(\InvXTX\) y defina tres escalares
\texttt{m11}, \texttt{m12} y \texttt{m22} correspondientes a los elementos (1,1), (1,2) y
(2,2) de la matriz.
\begin{verbatim}
open data3-1.gdt
series x  = sqft
series ys = 52 + 0.14*x
scalar s  = 39

matrix X   = {const, sqft}
matrix invXTX = invpd(X'X) # inversa de X'X
scalar m11 = invXTX[1,1]
scalar m21 = invXTX[2,1]
scalar m22 = invXTX[2,2]
\end{verbatim}

\item Dentro del bucle incluya dichos escalares \texttt{m11}, \texttt{m12} y \texttt{m22} en la
lista de parámetros a guardar

\begin{verbatim}
loop 10000 --progressive --quiet
   series y = ys + randgen(N, 0, s)
   ols y const x
   scalar b1   = $coeff(const)
   scalar b2   = $coeff(x)
   scalar cs2  = $ess/$df                      # cuasivarianza de los errores
   print b1 b2 cs2
   store "@workdir\coef.gdt" b1 b2 cs2 m11 m21 m22    
endloop
open "@workdir\coef.gdt"
summary   --simple  b1 b2 cs2
freq b1   --normal --silent --plot="display"
freq b2   --normal --silent --plot="display"
freq cs2  --normal --silent --plot="display"
\end{verbatim}

\item Finalmente, genere una matriz \texttt{S} de varianzas y covarianzas
muestrales de las estimaciones de los betas obtenidos en las 10000
iteraciones. Compárela con el promedio las matrices
\(\cvarM{}\InvXTX\) cuyos elementos (1,1), (1,2) y (2,2) son los
escalares \texttt{m11}, \texttt{m12} y \texttt{m22} (que guardamos en el punto anterior)
multiplicados por la media de las cuasivarianzas estimadas \texttt{cs2}.
\begin{verbatim}
matrix s2invXTXhat = {var(b1), cov(b1,b2); cov(b2,b1), var(b2)}
matrix s2invXTX    = mean(cs2)*{m11[1],m21[1];m21[1],m22[1]}
print s2invXTX s2invXTXhat
\end{verbatim}

\item En promedio ¿es \(\Estmd{\cvarM{}}\InvXTX\) un buen estimador de las
varianzas y covarianzas de los parámetros beta estimados en la
simulación?
\end{itemize}

\clearpage
\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{samplinghouses2.inp}}
\label{sec:orgb536e4f}
\vspace{10pt}
\lstinputlisting{scripts/samplinghouses2.inp}
\clearpage


\section{Repitiendo el experimento de Montecarlo muchas veces (perturbaciones con distribuciones no Gaussianas)}
\label{sec:org516fdce}
Complete el experimento de Montecarlo de la práctica anterior pero
generando perturbaciones con distribución no normal (aunque con
esperanza nula). Para ello

\begin{itemize}
\item Consulte la documentación sobre la función \texttt{randgen}.

\item Repita los experimentos del ejercicio anterior pero generando
perturbaciones con distribuciones distintas de la normal. Por
ejemplo pruebe con

\begin{itemize}
\item Distribución uniforme: \texttt{series U = randgen(u, -5, 5)}

\item Distribución beta (centrada): \texttt{series U = randgen(beta, 0.5, 0.5) - 0.5}

\item Distribución chi cuadrado (centrada): \texttt{series U = randgen(X, 3) - 3}
\end{itemize}

\item Observe los histogramas y distribuciones de frecuencia así como los
contrastes de normalidad. ¿Cambia mucho la distribución de los
estimadores de los betas? ¿Y la del estimador de la varianza
\(\sigma^2\) de las perturbaciones?

\item En promedio ¿es \(\Estmd{\cvarM{}}\InvXTX\) un buen estimador de las
varianzas y covarianzas de los parámetros beta estimados en la
simulación incluso cuando las preturbaciones tienen distribución muy
distinta a la gausiana?
\end{itemize}

\vspace{10pt}
\noindent
\subsection{Código completo de la práctica \texttt{samplinghouses3.inp}}
\label{sec:org7b8ec90}
\vspace{10pt}
\lstinputlisting{scripts/samplinghouses3.inp}
\clearpage
\end{document}